CSI API ETABS v1

# cPointElmIsSpringCoupled Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int IsSpringCoupled(
    	string Name,
    	ref bool IsCoupled
    )

    Function IsSpringCoupled (
    	Name As String,
    	ByRef IsCoupled As Boolean
    ) As Integer

    Dim instance As cPointElm
    Dim Name As String
    Dim IsCoupled As Boolean
    Dim returnValue As Integer

    returnValue = instance.IsSpringCoupled(Name,
    	IsCoupled)

    int IsSpringCoupled(
    	String^ Name,
    	bool% IsCoupled
    )

    abstract IsSpringCoupled :
            Name : string *
            IsCoupled : bool byref -> int

#### Parameters

Name

    Type: SystemString

IsCoupled

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com